tap "chaoscoder/tap"
brew "bat"
brew "btop"
brew "commitizen"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "jj"
brew "lazygit"
brew "neovim"
brew "opencode"
brew "powerlevel10k"
brew "ripgrep"
brew "tmux"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-meslo-lg-nerd-font"
cask "markedit"
cask "chaoscoder/tap/ports"
cask "cmux"
