tap "borkdude/brew"
tap "chaoscoder/tap"
tap "clojure/tools"
brew "bat"
brew "btop"
brew "cljfmt"
brew "commitizen"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "go"
brew "jj"
brew "lazygit"
brew "libomp"
brew "neovim"
brew "node"
brew "openjdk"
brew "pgvector"
brew "poetry"
brew "postgresql@17", restart_service: :changed, link: true
brew "powerlevel10k"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "tmux"
brew "triton"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "borkdude/brew/clj-kondo"
brew "clojure/tools/clojure"
cask "bitwarden"
cask "font-meslo-lg-nerd-font"
cask "markedit"
cask "chaoscoder/tap/ports"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
npm "@nestjs/cli"
npm "tsx"
